org-mode/查找各处org文件的内容.org
#+TITLE: 查找各处org文件的内容
#+URL: http://kitchingroup.cheme.cmu.edu/blog/2017/01/03/Find-stuff-in-org-mode-anywhere/
#+AUTHOR: sadwheel
#+TAGS: org-mode
#+DATE: [2017-04-02 日 23:20]
#+LANGUAGE:  zh-CN
#+OPTIONS:  H:6 num:nil toc:t \n:nil ::t |:t ^:nil -:nil f:t *:t <:nil

我经常使用org-mode.我用它写论文，记会议笔记，写推荐信，记文献笔记，维护项目的TODO列表和软件
的帮助文档，写演讲稿，甚至处理学生们的作业和保存联系人信息。我的一些文件存在Dropbox, GoogleDrive, Box
上，一些在git repos里。问题是，这样org文件就渐渐散布在我硬盘各处。如今我已经有了几千个org文件记录
着我五年来的工作。

像这样过上一段时间，查找文件就很困难了。确实有像recent-files, bookmarks, counsel-find-file,
helm-for-files, counsel/helm-locate, helm/counsel-grep/ag/pt, projectile 这样的工具
可以用来搜索项目里的文件，有一大堆工具可以搜索打开的buffer，还有 [[https://www.lesbonscomptes.com/recoll/][recoll]] 等桌面搜索工具，当然还得有良好的
组织习惯等等。但五年过去，我终于找到了查找目标文件的更好的方法。如果说想找一份我一年前创建的文件，但
它现在既不在当前目录或项目，也不在我的org-agenda-files列表里呢？还有，我怎样才能得到一份包含所有文件的todo
的动态列表呢？或是怎么找到包含特定bibtex entry的文件或某个学生所写的所有文件呢？

起初，[[http://kitchingroup.cheme.cmu.edu/blog/2015/07/06/Indexing-headlines-in-org-files-with-swish-e-with-laser-sharp-results/][我用Switch-e来给org文件作索引]], 这样搜索起来很容易，但它只能搜索headline或paragraph等等。
这个方法的问题是，由于Swish-e的局限我不得不每次重新生成数据库，因此作索引变得非常慢。后来我找到了
另一个方法－－一个更好的数据库。在这篇文章里，我将会用 [[http://sqlite.org][sqlite]] 来保存org文件中的headline和
link。

我的目标是每次打开或保存任何org文件时，它就会被添加进数据库或是更新数据库。这个数据库会保存headline，
property，content... 这样我就能够高效地查询那些包含我曾访问过的todo headine，tagged headline，
以及各类link的文件。让我们来看看有没有效果吧。

