blog/2017/04/02/查找各处org文件的内容/index.html
<!DOCTYPE html>
<html lang="en">
<head>
  <title>查找各处org文件的内容 - EMACS-DOCUMENT</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge"/>
  <meta name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no"/>
  <meta name="author" content="sadwheel" />
  <meta name="keywords" content="org-mode" />
  <!-- <link rel="stylesheet" href="../../../../../media/css/main.css" type="text/css"/>
       <link rel="stylesheet" href="../../../../../media/css/comment.css" type="text/css"/> -->
  <link rel='stylesheet' href='https://cdn.jsdelivr.net/gh/kognise/water.css@latest/dist/dark.css'>
  <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/gitalk@1/dist/gitalk.css">
</head>

  <body><div class="container">
<div>
  <header class="masthead">
    <h1 class="masthead-title"><a href="../../../../../">EMACS-DOCUMENT</a></h1>
    <p>=============&gt;集思广益</p>
    <nav class="site-nav">
      <ul class="trigger">
        <li><a href="../../../../../years/">Years</a></li>
        <li><a href="../../../../../authors/">Authors</a></li>
        <li><a href="../../../../../tags/">Tags</a></li>
        <li><a href="../../../../../about/">About</a></li>
        <li><a href="https://github.com/lujun9972/emacs-document">Github</a></li>
        <li><a href="../../../../../rss.xml">RSS</a></li>
      </ul>
    </nav>
    <form method="get" id="searchform" action="https://www.bing.com/search">
      <input type="text" class="field" name="q" id="s" placeholder="Search">
      <input type="hidden" name="as_sitesearch" value="lujun9972.github.io/emacs-document">
    </form>
  </header>
</div>

<div>
<div class="post">
<h1 class="title">查找各处org文件的内容</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org646c5c2">1 数据库结构</a></li>
<li><a href="#orgf621a6c">2 查询链接表</a></li>
<li><a href="#org50f0eeb">3 查询标题</a></li>
<li><a href="#orga2c5a08">4 查询关键字</a></li>
<li><a href="#org63720d2">5 全文搜索</a></li>
<li><a href="#org916d273">6 总结</a></li>
</ul>
</div>
</div>
<p>
我经常使用org-mode.我用它写论文，记会议笔记，写推荐信，记文献笔记，维护项目的TODO列表和软件
的帮助文档，写演讲稿，甚至处理学生们的作业和保存联系人信息。我的一些文件存在Dropbox, GoogleDrive, Box
上，一些在git repos里。问题是，这样org文件就渐渐散布在我硬盘各处。如今我已经有了几千个org文件记录
着我五年来的工作。
</p>

<p>
像这样过上一段时间，查找文件就很困难了。确实有像recent-files, bookmarks, counsel-find-file,
helm-for-files, counsel/helm-locate, helm/counsel-grep/ag/pt, projectile 这样的工具
可以用来搜索项目里的文件，有一大堆工具可以搜索打开的buffer，还有 <a href="https://www.lesbonscomptes.com/recoll/">recoll</a> 等桌面搜索工具，当然还得有良好的
组织习惯等等。但五年过去，我终于找到了查找目标文件的更好的方法。如果说想找一份我一年前创建的文件，但
它现在既不在当前目录或项目，也不在我的org-agenda-files列表里呢？还有，我怎样才能得到一份包含所有文件的todo
的动态列表呢？或是怎么找到包含特定bibtex entry的文件或某个学生所写的所有文件呢？
</p>

<p>
起初，<a href="http://kitchingroup.cheme.cmu.edu/blog/2015/07/06/Indexing-headlines-in-org-files-with-swish-e-with-laser-sharp-results/">我用Switch-e来给org文件作索引</a>, 这样搜索起来很容易，但它只能搜索headline或paragraph等等。
这个方法的问题是，由于Swish-e的局限我不得不每次重新生成数据库，因此作索引变得非常慢。后来我找到了
另一个方法－－一个更好的数据库。在这篇文章里，我将会用 <a href="http://sqlite.org">sqlite</a> 来保存org文件中的headline和
link。
</p>

<p>
我的目标是每次打开或保存任何org文件时，它就会被添加进数据库或是更新数据库。这个数据库会保存headline，
property，content... 这样我就能够高效地查询那些包含我曾访问过的todo headine，tagged headline，
以及各类link的文件。让我们来看看有没有效果吧。
</p>
