org-mode/查找各处org文件的内容.org
* 1 数据库结构

我用 [[https://github.com/skeeto/emacsql][emacsql]] 来创建sqlite3数据库并与之交互。它能够用lisp来生成SQL query。我不会
在这讨论太多代码，你想了解的话可以看看这个： [[http://kitchingroup.cheme.cmu.edu/media/org-db.el][org-db.el]] 。数据库由一些包含filename，
headline，tag，property，headline-content（可选），headline-tags，headline-property，
和link的表（table）组成。这里的lisp代码只是作为演示而非我日常使用的。这篇文章只是用来证明
这方法的效果。

当org文件被打开或保存时，我用hook来更新数据库（当然只有当文件与数据库中内容不同时才会更新，
基于md5码校验）。通常，这些函数先删除文件在数据库中的entry再把数据添加回库。我发现
这比用org-element来parse org文件更快，尤其是处理大文件时。因为这些都由hook来完成，
所以无论我在何时何地打开一个org 文件，它都会被加进数据库或是更新数据库，效果还可以。虽然这个
方法不能保证数据库永远保持准确（比如文件在emacs外被更改，如一次git pull），但它也并不需要
永远准确，大多数文件都不会经常改动，而数据库在每次打开文件时都会更新。你也可以手动让数据库为
文件重建索引。渐渐的你会找出合适的更新频率。

emacsql 允许你用lisp代码生成SQL送往数据库。下面是个例子：

#+BEGIN_SRC emacs-lisp
  (emacsql-flatten-sql [:select [name] :from main:sqlite_master :where (= type table)])
#+END_SRC

#+BEGIN_SRC sql
  SELECT name FROM main.sqlite_master WHERE type = "table";
#+END_SRC

这里有些微小的差异，比如main:sqlite_master会被转换成main.sqlite_master。你可以用vector，
keyword和sexps来设置命令。emacsql会把像filename-id这样的名字转换成filename_id。理解起来
并不困难，而且emacsql的作者很热心。我以后会回头看看这篇文章来回顾这些差异。

下面是一个数据库中表（table）的列表。有一些主表（primary table），还有一些表（table）
只保存标题里的tag，property和keyword。这是典型的emacsql代码：一条生成SQL的lisp表达式。
表达式中的org-db是个保存数据库连接（database connection）的变量。它由org-db.el创建。

#+BEGIN_SRC emacs-lisp
  (emacsql org-db [:select [name] :from main:sqlite_master :where (= type table)])
#+END_SRC

+---------------------------+
| files                     |
|---------------------------|
| tags                      |
|---------------------------|
| properties                |
|---------------------------|
| keywords                  |
|---------------------------|
| headlines                 |
|---------------------------|
| headline_content          |
|---------------------------|
| headline_content_content  |
|---------------------------|
| headline_content_segments |
|---------------------------|
| headline_content_segdir   |
|---------------------------|
| headline_content_docsize  |
|---------------------------|
| headline_content_stat     |
|---------------------------|
| headline_tags             |
|---------------------------|
| headline_properties       |
|---------------------------|
| file_keywords             |
|---------------------------|
| links                     |
+---------------------------+

这是文件表（files table）里各列的描述：

#+BEGIN_SRC emacs-lisp
  (emacsql org-db [:pragma (funcall table_info files)])
#+END_SRC

+-----------------------------------------+
| 0 | rowid     | INTEGER | 0   | nil | 1 |
|---+-----------+---------+-----+-----+---|
| 1 | filename  | 0       | nil | 0   |   |
|---+-----------+---------+-----+-----+---|
| 2 | md5       | 0       | nil | 0   |   |
+-----------------------------------------+

还有标题表（headlines table）里的各列：

#+BEGIN_SRC emacs-lisp
  (emacsql org-db [:pragma (funcall table_info headlines)])
#+END_SRC

+--------------------------------------------------+
| 0 | rowid              | INTEGER | 0   | nil | 1 |
|---+--------------------+---------+-----+-----+---|
| 1 | filename_id        | 0       | nil | 0   |   |
|---+--------------------+---------+-----+-----+---|
| 2 | title              | 0       | nil | 0   |   |
|---+--------------------+---------+-----+-----+---|
| 3 | level              | 0       | nil | 0   |   |
|---+--------------------+---------+-----+-----+---|
| 4 | todo_keyword       | 0       | nil | 0   |   |
|---+--------------------+---------+-----+-----+---|
| 5 | todo_type          | 0       | nil | 0   |   |
|---+--------------------+---------+-----+-----+---|
| 6 | archivedp          | 0       | nil | 0   |   |
|---+--------------------+---------+-----+-----+---|
| 7 | commentedp         | 0       | nil | 0   |   |
|---+--------------------+---------+-----+-----+---|
| 8 | footnote_section_p | 0       | nil | 0   |   |
|---+--------------------+---------+-----+-----+---|
| 9 | begin              | 0       | nil | 0   |   |
+--------------------------------------------------+

标题里的标签和属性保存在 headline-tags 和 headline-properties 两张表里。

如果只保存标题和链接（不保存内容）的话，数据库不会很大。而保存了内容后，它会达到500MB而且
变得有点慢。所以这篇文章里，我就不讨论包含内容的表了。

#+BEGIN_SRC shell
  du -hs ~/org-db/org-db.sqlite
#+END_SRC

+--------------------------------------------+
| 56M | /Users/jkitchin/org-db/org-db.sqlite |
+--------------------------------------------+

我们可以看看数据库里有多少文件。这些只是我Dropbox文件夹里的org文件。除此之外还有很多！如果
我把我所有的研究和教学项目的org文件包括进来，这个数字会达到10,000! 你是不会想要对这些文件
运行org-map-entries的。注意这也包括了所有的org_archive文件。

#+BEGIN_SRC emacs-lisp
  (emacsql org-db [:select (funcall count) :from files])
#+END_SRC

+------+
| 1569 |
+------+

这是标题总数。你可以看到根本不可能记住这些标题都在哪里！

#+BEGIN_SRC emacs-lisp
  (emacsql org-db [:select (funcall count) :from headlines])
#+END_SRC

+-------+
| 38587 |
+-------+

还有链接总数。有如此多链接！

#+BEGIN_SRC emacs-lisp
  (emacsql org-db [:select (funcall count) :from links])
#+END_SRC

+--------+
| 303739 |
+--------+

这真是一堆数目可观的链接。

