blog/2017/04/02/查找各处org文件的内容/index.html

<div id="outline-container-org646c5c2" class="outline-2">
<h2 id="org646c5c2">1 数据库结构</h2>
<div class="outline-text-2" id="text-org646c5c2">
<p>
我用 <a href="https://github.com/skeeto/emacsql">emacsql</a> 来创建sqlite3数据库并与之交互。它能够用lisp来生成SQL query。我不会
在这讨论太多代码，你想了解的话可以看看这个： <a href="http://kitchingroup.cheme.cmu.edu/media/org-db.el">org-db.el</a> 。数据库由一些包含filename，
headline，tag，property，headline-content（可选），headline-tags，headline-property，
和link的表（table）组成。这里的lisp代码只是作为演示而非我日常使用的。这篇文章只是用来证明
这方法的效果。
</p>

<p>
当org文件被打开或保存时，我用hook来更新数据库（当然只有当文件与数据库中内容不同时才会更新，
基于md5码校验）。通常，这些函数先删除文件在数据库中的entry再把数据添加回库。我发现
这比用org-element来parse org文件更快，尤其是处理大文件时。因为这些都由hook来完成，
所以无论我在何时何地打开一个org 文件，它都会被加进数据库或是更新数据库，效果还可以。虽然这个
方法不能保证数据库永远保持准确（比如文件在emacs外被更改，如一次git pull），但它也并不需要
永远准确，大多数文件都不会经常改动，而数据库在每次打开文件时都会更新。你也可以手动让数据库为
文件重建索引。渐渐的你会找出合适的更新频率。
</p>

<p>
emacsql 允许你用lisp代码生成SQL送往数据库。下面是个例子：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>emacsql-flatten-sql <span style="color: #bc6ec5;">[</span><span style="color: #4f97d7;">:select</span> <span style="color: #2d9574;">[</span>name<span style="color: #2d9574;">]</span> <span style="color: #4f97d7;">:from</span> main:sqlite_master <span style="color: #4f97d7;">:where</span> <span style="color: #2d9574;">(</span>= type table<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #4f97d7; font-weight: bold;">SELECT</span> <span style="color: #4f97d7; font-weight: bold;">name</span> <span style="color: #4f97d7; font-weight: bold;">FROM</span> main.sqlite_master <span style="color: #4f97d7; font-weight: bold;">WHERE</span> <span style="color: #4f97d7; font-weight: bold;">type</span> = "<span style="color: #4f97d7; font-weight: bold;">table</span>";
</pre>
</div>

<p>
这里有些微小的差异，比如main:sqlite_master会被转换成main.sqlite_master。你可以用vector，
keyword和sexps来设置命令。emacsql会把像filename-id这样的名字转换成filename_id。理解起来
并不困难，而且emacsql的作者很热心。我以后会回头看看这篇文章来回顾这些差异。
</p>

<p>
下面是一个数据库中表（table）的列表。有一些主表（primary table），还有一些表（table）
只保存标题里的tag，property和keyword。这是典型的emacsql代码：一条生成SQL的lisp表达式。
表达式中的org-db是个保存数据库连接（database connection）的变量。它由org-db.el创建。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>emacsql org-db <span style="color: #bc6ec5;">[</span><span style="color: #4f97d7;">:select</span> <span style="color: #2d9574;">[</span>name<span style="color: #2d9574;">]</span> <span style="color: #4f97d7;">:from</span> main:sqlite_master <span style="color: #4f97d7;">:where</span> <span style="color: #2d9574;">(</span>= type table<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<!-- This HTML table template is generated by emacs 26.2 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;files&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      ---------------------------<br />
      &nbsp;tags&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      ---------------------------<br />
      &nbsp;properties&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      ---------------------------<br />
      &nbsp;keywords&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      ---------------------------<br />
      &nbsp;headlines&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      ---------------------------<br />
      &nbsp;headline_content&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      ---------------------------<br />
      &nbsp;headline_content_content&nbsp;&nbsp;<br />
      ---------------------------<br />
      &nbsp;headline_content_segments&nbsp;<br />
      ---------------------------<br />
      &nbsp;headline_content_segdir&nbsp;&nbsp;&nbsp;<br />
      ---------------------------<br />
      &nbsp;headline_content_docsize&nbsp;&nbsp;<br />
      ---------------------------<br />
      &nbsp;headline_content_stat&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      ---------------------------<br />
      &nbsp;headline_tags&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      ---------------------------<br />
      &nbsp;headline_properties&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      ---------------------------<br />
      &nbsp;file_keywords&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      ---------------------------<br />
      &nbsp;links&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
</table>

<p>
这是文件表（files table）里各列的描述：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>emacsql org-db <span style="color: #bc6ec5;">[</span><span style="color: #4f97d7;">:pragma</span> <span style="color: #2d9574;">(</span>funcall table_info files<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<!-- This HTML table template is generated by emacs 26.2 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;0&nbsp;
    </td>
  </tr>
</table>

<p>
还有标题表（headlines table）里的各列：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>emacsql org-db <span style="color: #bc6ec5;">[</span><span style="color: #4f97d7;">:pragma</span> <span style="color: #2d9574;">(</span>funcall table_info headlines<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<!-- This HTML table template is generated by emacs 26.2 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;0&nbsp;
    </td>
  </tr>
</table>

<p>
标题里的标签和属性保存在 headline-tags 和 headline-properties 两张表里。
</p>

<p>
如果只保存标题和链接（不保存内容）的话，数据库不会很大。而保存了内容后，它会达到500MB而且
变得有点慢。所以这篇文章里，我就不讨论包含内容的表了。
</p>

<div class="org-src-container">
<pre class="src src-shell">du -hs ~/org-db/org-db.sqlite
</pre>
</div>

<!-- This HTML table template is generated by emacs 26.2 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;56M&nbsp;|&nbsp;/Users/jkitchin/org-db/org-db.sqlite&nbsp;
    </td>
  </tr>
</table>

<p>
我们可以看看数据库里有多少文件。这些只是我Dropbox文件夹里的org文件。除此之外还有很多！如果
我把我所有的研究和教学项目的org文件包括进来，这个数字会达到10,000! 你是不会想要对这些文件
运行org-map-entries的。注意这也包括了所有的org_archive文件。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>emacsql org-db <span style="color: #bc6ec5;">[</span><span style="color: #4f97d7;">:select</span> <span style="color: #2d9574;">(</span>funcall count<span style="color: #2d9574;">)</span> <span style="color: #4f97d7;">:from</span> files<span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<!-- This HTML table template is generated by emacs 26.2 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;1569&nbsp;
    </td>
  </tr>
</table>

<p>
这是标题总数。你可以看到根本不可能记住这些标题都在哪里！
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>emacsql org-db <span style="color: #bc6ec5;">[</span><span style="color: #4f97d7;">:select</span> <span style="color: #2d9574;">(</span>funcall count<span style="color: #2d9574;">)</span> <span style="color: #4f97d7;">:from</span> headlines<span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<!-- This HTML table template is generated by emacs 26.2 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;38587&nbsp;
    </td>
  </tr>
</table>

<p>
还有链接总数。有如此多链接！
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>emacsql org-db <span style="color: #bc6ec5;">[</span><span style="color: #4f97d7;">:select</span> <span style="color: #2d9574;">(</span>funcall count<span style="color: #2d9574;">)</span> <span style="color: #4f97d7;">:from</span> links<span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<!-- This HTML table template is generated by emacs 26.2 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;303739&nbsp;
    </td>
  </tr>
</table>

<p>
这真是一堆数目可观的链接。
</p>
</div>
</div>
