org-mode/查找各处org文件的内容.org
* 2 查询链接表

让我们看看有多少引用链接（cite link）：

#+BEGIN_SRC emacs-lisp
  (emacsql org-db [:select (funcall count) :from links :where (= type "cite")])
#+END_SRC

+-------+
| 14766 |
+-------+

哇，这些链接也好多！我以写proposal和paper为生，我用org-ref来简化工作，所以也许这个数字
没什么奇怪的。我们可以在链接表（link table）里搜索引用了"kitchin-2015-examp"的文件。链接表
里只有filename-id,所以我们把它和文件表合并来得出有用的信息。这里我们可以看到引用了
"kitchin-2015-examp"的文件列表。里面有手稿，企划，展示，文档和笔记。

#+BEGIN_SRC emacs-lisp
  (emacsql org-db [:select :distinct [files:filename]
                           :from links :inner :join files :on (= links:filename-id files:rowid) 
                           :where (and (= type "cite") (like path "%kitchin-2015-examp%"))])
#+END_SRC

+----------------------------------------------------------------------------+
| /Users/jkitchin/Dropbox/CMU/manuscripts/2015/                              |
| Research_Data_Publishing_Paper/manuscript.org                              |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/CMU/manuscripts/2015/                              |
| Research_Data_Publishing_Paper/manuscript-2015-06-29/manuscript.org        |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/CMU/manuscripts/2015/                              |
| Research_Data_Publishing_Paper/manuscript-2015-10-10/manuscript.org        |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/CMU/manuscripts/2015/                              |
| Research_Data_Publishing_Paper/manuscript-2016-03-09/manuscript.org        |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/CMU/manuscripts/2015/                              |
| Research_Data_Publishing_Paper/manuscript-2016-04-18/manuscript.org        |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/CMU/manuscripts/2015/human-readable-data/          |
| manuscript.org                                                             |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/CMU/manuscripts/@archive/2015/                     |
| Research_Data_Publishing_Paper/manuscript.org                              |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/CMU/manuscripts/@archive/2015/                     |
| Research_Data_Publishing_Paper/manuscript-2015-06-29/manuscript.org        |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/CMU/manuscripts/@archive/2015/                     |
| Research_Data_Publishing_Paper/manuscript-2015-10-10/manuscript.org        |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/CMU/manuscripts/@archive/2015/                     |
| Research_Data_Publishing_Paper/manuscript-2016-03-09/manuscript.org        |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/CMU/manuscripts/@archive/2015/                     |
| Research_Data_Publishing_Paper/manuscript-2016-04-18/manuscript.org        |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/CMU/manuscripts/@archive/2015/human-readable-data/ |
| manuscript.org                                                             |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/CMU/meetings/@archive/2015/BES-2015/               |
| doe-bes-wed-data-briefing/doe-bes-wed-data-sharing.org                     |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/CMU/meetings/@archive/2015/NIST-july-2015/         |
| data-sharing.org                                                           |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/CMU/meetings/@archive/2015/UD-webinar/             |
| ud-webinar.org                                                             |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/CMU/meetings/@archive/2016/AICHE/data-sharing/     |
| data-sharing.org                                                           |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/CMU/meetings/@archive/2016/Spring-ACS/data-sharing |
| /data-sharing.org                                                          |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/CMU/projects/DOE-Early-Career/annual-reports/      |
| final-report/kitchin-DESC0004031-final-report.org                          |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/CMU/proposals/@archive/2015/DOE-renewal/           |
| proposal-v2.org                                                            |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/CMU/proposals/@archive/2015/DOE-renewal/archive/   |
| proposal.org                                                               |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/CMU/proposals/@archive/2016/DOE-single-atom-alloy/ |
| proposal.org                                                               |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/CMU/proposals/@archive/2016/MRSEC/                 |
| MRSEC-IRG-metastable-materials-preproposal/IRG-concept.org                 |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/CMU/proposals/@archive/2016/ljaf-open-science/     |
| kitchin-proposal.org                                                       |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/CMU/proposals/@archive/2016/nsf-germination/       |
| project-description.org                                                    |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/CMU/proposals/@archive/2016/nsf-reu-supplement/    |
| project-description.org                                                    |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/CMU/proposals/@archive/2016/                       |
| proctor-and-gamble-education/proposal.org                                  |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/bibliography/notes.org                             |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/kitchingroup/jmax/org-ref/citeproc/readme.org      |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/kitchingroup/jmax/org-ref/citeproc/                |
| readme-unsrt.org                                                           |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/kitchingroup/jmax/org-ref/citeproc/                |
| readme-author-year.org                                                     |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/kitchingroup/jmax/org-ref/tests/test-1.org         |
|----------------------------------------------------------------------------|
| /Users/jkitchin/Dropbox/kitchingroup/jmax/org-ref/tests/sandbox/elpa/      |
| org-ref-20160122.1725/citeproc/readme.org                                  |
+----------------------------------------------------------------------------+

很明显，我们可以用这种方式生成helm和ivy这类工具的候选条目。

#+BEGIN_SRC emacs-lisp
  (ivy-read "Open: " (emacsql org-db [:select [files:filename links:begin]
                                              :from links :inner :join files :on (= links:filename-id files:rowid) 
                                              :where (and (= type "cite") (like path "%kitchin-2015-examp%"))])
            :action '(1 ("o"
                         (lambda (c)
                           (find-file (car c))
                           (goto-char (nth 1 c))
                           (org-show-entry)))))
#+END_SRC

#+BEGIN_EXAMPLE
  /Users/jkitchin/Dropbox/CMU/manuscripts/2015/human-readable-data/manuscript.org
#+END_EXAMPLE

现在，你可以找到引用任何bibtex key的所有文件。因为SQL是查询语言（query language），
你应该可以写出更复杂的查询（query），比如过滤出多次引用（multiple citation）和
不同引用等等。

