org-mode/查找各处org文件的内容.org
* 3 查询标题

每个标题，连同它的位置，标签和属性都被保存了下来。我们可以用数据库找到带有标签或特定属性的标题。
你可以看到我的数据库里有293个标签。

#+BEGIN_SRC emacs-lisp
  (emacsql org-db [:select (funcall count) :from tags])
#+END_SRC

+-----+
| 293 |
+-----+

这里我们查找带有electrolyte标签的标题。我有时用它来标记一些相关的文献。

#+BEGIN_SRC emacs-lisp
  (emacsql org-db [:select :distinct [files:filename headlines:title]
                           :from headlines :inner :join headline-tags :on (=  headlines:rowid headline-tags:headline-id)
                           :inner :join tags :on (= tags:rowid headline-tags:tag-id)
                           :inner :join files :on (= headlines:filename-id files:rowid)
                           :where (= tags:tag "electrolyte") :limit 5])
#+END_SRC

+----------------------------------------------------------------------------+
| /Users/jkitchin/Dropbox/ | 2010 - Nickel-borate oxygen-evolving catalyst   |
| org-mode/                | that functions under benign conditions          |
| prj-doe-early-career.org |                                                 |
|--------------------------+-------------------------------------------------|
|                          | 1971 - A Correlation of the Solution Properties |
| /Users/jkitchin/Dropbox/ | and the Electrochemical Behavior of the Nickel  |
| bibliography/notes.org   | Hydroxide Electrode in Binary Aqueous Alkali    |
|                          | Hydroxides                                      |
|--------------------------+-------------------------------------------------|
| /Users/jkitchin/Dropbox/ | 1981 - Studies concerning charged nickel        |
| bibliography/notes.org   | hydroxide electrodes IV. Reversible potentials  |
|                          | in LiOH, NaOH, RbOH and CsOH                    |
|--------------------------+-------------------------------------------------|
| /Users/jkitchin/Dropbox/ | 1986 - The effect of lithium in preventing iron |
| bibliography/notes.org   | poisoning in the nickel hydroxide electrode     |
|--------------------------+-------------------------------------------------|
|                          | 1996 - The role of lithium in preventing the    |
| /Users/jkitchin/Dropbox/ | detrimental effect of iron on alkaline battery  |
| bibliography/notes.org   | nickel hydroxide electrode: A mechanistic       |
|                          | aspect                                          |
+----------------------------------------------------------------------------+

这里我们可以看到有很多带EMAIL属性的entry，这些可以作为邮件联系人。

#+BEGIN_SRC emacs-lisp
  (emacsql org-db [:select [(funcall count)] :from
                           headlines :inner :join headline-properties :on (=  headlines:rowid headline-properties:headline-id)
                           :inner :join properties :on (= properties:rowid headline-properties:property-id)
                           :where (and (= properties:property "EMAIL") (not (null headline-properties:value)))])
#+END_SRC

+------+
| 7452 |
+------+

如果你想看匹配"jkitchin"的标题，它们在这。

#+BEGIN_SRC emacs-lisp
  (emacsql org-db [:select :distinct [headlines:title headline-properties:value] :from
                           headlines :inner :join headline-properties :on (=  headlines:rowid headline-properties:headline-id)
                           :inner :join properties :on (= properties:rowid headline-properties:property-id)
                           :where (and (= properties:property "EMAIL") (like headline-properties:value "%jkitchin%"))])
#+END_SRC

+-----------------------------------------+
| John Kitchin  | jkitchin@andrew.cmu.edu |
|---------------+-------------------------|
| John Kitchin  | jkitchin@cmu.edu        |
|---------------+-------------------------|
| Kitchin, John | jkitchin@andrew.cmu.edu |
+-----------------------------------------+

这是一个查找有多少deadline是2017年的标题。看来我很忙啊！

#+BEGIN_SRC emacs-lisp
  (emacsql org-db [:select (funcall count) :from
                           headlines :inner :join headline-properties :on (=  headlines:rowid headline-properties:headline-id)
                           :inner :join properties :on (= properties:rowid headline-properties:property-id)
                           :where (and (= properties:property "DEADLINE") (glob headline-properties:value "*2017*"))])
#+END_SRC

+----+
| 50 |
+----+

