blog/2017/04/02/查找各处org文件的内容/index.html

<div id="outline-container-org50f0eeb" class="outline-2">
<h2 id="org50f0eeb">3 查询标题</h2>
<div class="outline-text-2" id="text-org50f0eeb">
<p>
每个标题，连同它的位置，标签和属性都被保存了下来。我们可以用数据库找到带有标签或特定属性的标题。
你可以看到我的数据库里有293个标签。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>emacsql org-db <span style="color: #bc6ec5;">[</span><span style="color: #4f97d7;">:select</span> <span style="color: #2d9574;">(</span>funcall count<span style="color: #2d9574;">)</span> <span style="color: #4f97d7;">:from</span> tags<span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<!-- This HTML table template is generated by emacs 26.2 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;293&nbsp;
    </td>
  </tr>
</table>

<p>
这里我们查找带有electrolyte标签的标题。我有时用它来标记一些相关的文献。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>emacsql org-db <span style="color: #bc6ec5;">[</span><span style="color: #4f97d7;">:select</span> <span style="color: #4f97d7;">:distinct</span> <span style="color: #2d9574;">[</span>files:filename headlines:title<span style="color: #2d9574;">]</span>
                         <span style="color: #4f97d7;">:from</span> headlines <span style="color: #4f97d7;">:inner</span> <span style="color: #4f97d7;">:join</span> headline-tags <span style="color: #4f97d7;">:on</span> <span style="color: #2d9574;">(</span>=  headlines:rowid headline-tags:headline-id<span style="color: #2d9574;">)</span>
                         <span style="color: #4f97d7;">:inner</span> <span style="color: #4f97d7;">:join</span> tags <span style="color: #4f97d7;">:on</span> <span style="color: #2d9574;">(</span>= tags:rowid headline-tags:tag-id<span style="color: #2d9574;">)</span>
                         <span style="color: #4f97d7;">:inner</span> <span style="color: #4f97d7;">:join</span> files <span style="color: #4f97d7;">:on</span> <span style="color: #2d9574;">(</span>= headlines:filename-id files:rowid<span style="color: #2d9574;">)</span>
                         <span style="color: #4f97d7;">:where</span> <span style="color: #2d9574;">(</span>= tags:tag <span style="color: #2d9574;">"electrolyte"</span><span style="color: #2d9574;">)</span> <span style="color: #4f97d7;">:limit</span> <span style="color: #a45bad;">5</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<!-- This HTML table template is generated by emacs 26.2 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;/Users/jkitchin/Dropbox/&nbsp;<br />
      &nbsp;org-mode/&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;prj-doe-early-career.org&nbsp;
    </td>
  </tr>
</table>

<p>
这里我们可以看到有很多带EMAIL属性的entry，这些可以作为邮件联系人。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>emacsql org-db <span style="color: #bc6ec5;">[</span><span style="color: #4f97d7;">:select</span> <span style="color: #2d9574;">[</span><span style="color: #67b11d;">(</span>funcall count<span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span> <span style="color: #4f97d7;">:from</span>
                         headlines <span style="color: #4f97d7;">:inner</span> <span style="color: #4f97d7;">:join</span> headline-properties <span style="color: #4f97d7;">:on</span> <span style="color: #2d9574;">(</span>=  headlines:rowid headline-properties:headline-id<span style="color: #2d9574;">)</span>
                         <span style="color: #4f97d7;">:inner</span> <span style="color: #4f97d7;">:join</span> properties <span style="color: #4f97d7;">:on</span> <span style="color: #2d9574;">(</span>= properties:rowid headline-properties:property-id<span style="color: #2d9574;">)</span>
                         <span style="color: #4f97d7;">:where</span> <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #67b11d;">(</span>= properties:property <span style="color: #2d9574;">"EMAIL"</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span>not <span style="color: #b1951d;">(</span>null headline-properties:value<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<!-- This HTML table template is generated by emacs 26.2 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;7452&nbsp;
    </td>
  </tr>
</table>

<p>
如果你想看匹配"jkitchin"的标题，它们在这。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>emacsql org-db <span style="color: #bc6ec5;">[</span><span style="color: #4f97d7;">:select</span> <span style="color: #4f97d7;">:distinct</span> <span style="color: #2d9574;">[</span>headlines:title headline-properties:value<span style="color: #2d9574;">]</span> <span style="color: #4f97d7;">:from</span>
                         headlines <span style="color: #4f97d7;">:inner</span> <span style="color: #4f97d7;">:join</span> headline-properties <span style="color: #4f97d7;">:on</span> <span style="color: #2d9574;">(</span>=  headlines:rowid headline-properties:headline-id<span style="color: #2d9574;">)</span>
                         <span style="color: #4f97d7;">:inner</span> <span style="color: #4f97d7;">:join</span> properties <span style="color: #4f97d7;">:on</span> <span style="color: #2d9574;">(</span>= properties:rowid headline-properties:property-id<span style="color: #2d9574;">)</span>
                         <span style="color: #4f97d7;">:where</span> <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #67b11d;">(</span>= properties:property <span style="color: #2d9574;">"EMAIL"</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span>like headline-properties:value <span style="color: #2d9574;">"%jkitchin%"</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<!-- This HTML table template is generated by emacs 26.2 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;John&nbsp;Kitchin&nbsp;&nbsp;
    </td>
  </tr>
</table>

<p>
这是一个查找有多少deadline是2017年的标题。看来我很忙啊！
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>emacsql org-db <span style="color: #bc6ec5;">[</span><span style="color: #4f97d7;">:select</span> <span style="color: #2d9574;">(</span>funcall count<span style="color: #2d9574;">)</span> <span style="color: #4f97d7;">:from</span>
                         headlines <span style="color: #4f97d7;">:inner</span> <span style="color: #4f97d7;">:join</span> headline-properties <span style="color: #4f97d7;">:on</span> <span style="color: #2d9574;">(</span>=  headlines:rowid headline-properties:headline-id<span style="color: #2d9574;">)</span>
                         <span style="color: #4f97d7;">:inner</span> <span style="color: #4f97d7;">:join</span> properties <span style="color: #4f97d7;">:on</span> <span style="color: #2d9574;">(</span>= properties:rowid headline-properties:property-id<span style="color: #2d9574;">)</span>
                         <span style="color: #4f97d7;">:where</span> <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #67b11d;">(</span>= properties:property <span style="color: #2d9574;">"DEADLINE"</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span>glob headline-properties:value <span style="color: #2d9574;">"*2017*"</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<!-- This HTML table template is generated by emacs 26.2 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;50&nbsp;
    </td>
  </tr>
</table>
</div>
</div>
